W7D3/music/app/models/user.rb

  def self.find_by_credentials(email, pw)
    user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "email"], ["LIMIT", 1]]

  def generate_unique_token
    token = SecureRandom.urlsafe_base64(30)

    while User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_unique_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-02-21 23:44:22.359067"], ["id", 3]]