W7D3/music/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    flash[:email] = @user.email

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "email"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2023-02-21 23:44:22.340204"], ["updated_at", "2023-02-21 23:44:22.340204"], ["band_id", nil]]