W7D1/ninety-nine-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cat = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    # debugger
    if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "birth_date" = $1, "color" = $2, "name" = $3, "sex" = $4, "description" = $5, "updated_at" = $6 WHERE "cats"."id" = $7  [["birth_date", "1999-12-27"], ["color", "black"], ["name", "gary"], ["sex", "M"], ["description", "my favorite cat\r\n    "], ["updated_at", "2023-02-19 21:52:41.272456"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)